ZachStephens/TI_MSP430/P7_ADC_AExample/main.c
#include <msp430.h> 




//drives Brushless DC motor basic HW 30 Amp ESC.
//PWM of 50% a@ period 2ms engages the esc
//PWM 75%-100% (translates to 1.5-2 ms) adjusts throttle


unsigned int ADC_result=0;
static unsigned int t1;
static unsigned int highcount;
static unsigned int resolution;
#define G_LED BIT6                        // Green G_LED -> P1.6


// Function prototypes
void ConfigureAdc(void);



#pragma vector = TIMER0_A0_VECTOR       // CCR0 Interrupt Vector
__interrupt void CCR0_ISR(void)
{
    TA0CTL &= ~TAIFG;               //clear timer A interrupt flag

    t1=(++t1 > (resolution-1) )?0:t1;

    if(t1 >= highcount)
        P1OUT &= ~G_LED;
    else
        P1OUT |= G_LED;
}


void main(void)
{
    {
        WDTCTL = WDTPW + WDTHOLD;       // Stop WDT

        P1DIR |= G_LED;                       // Set G_LED pin -> Output
       P1OUT &=~ G_LED;                      // Turn OFF G_LED

       resolution= 30;
       highcount = 15;
       TACCR0 = 55;                      // Set Timer Timeout Value
       TACCTL0 |= CCIE;                   // Enable Overflow Interrupt
       TACTL |=   MC_1                    // mode count up to CCR0
                | TASSEL_2     // clock source sm_clk 1Mhz +-10%
                | TACLR        //timer A counter clear
                |  ID_0;       //divides A clock by 1,2,4 or 8 if 0,1,2,or 3 respectively


        BCSCTL1 = CALBC1_1MHZ;          // Set range   DCOCTL = CALDCO_1MHZ;
        BCSCTL2 &= ~(DIVS_3);           // SMCLK = DCO = 1MHz
        P1SEL |= BIT3;                  // ADC input pin P1.3
        ConfigureAdc();                 // ADC set-up function call
        __enable_interrupt();           // Enable interrupts.

        while(1)
        {
            __delay_cycles(1000);               // Wait for ADC Ref to settle
            ADC10CTL0 |= ENC + ADC10SC;         // Sampling and conversion start
            //__bis_SR_register(CPUOFF + GIE);    // Low Power Mode 0 with interrupts enabled
            ADC_result = ADC10MEM;               // Assigns the value held in ADC10MEM to the integer called ADC_value
            highcount=14+(ADC_result >> 6);
        }

    }
}

// ADC10 interrupt service routine
#pragma vector=ADC10_VECTOR
__interrupt void ADC10_ISR (void)
{
    __bic_SR_register_on_exit(CPUOFF);        // Return to active mode }
}

// Function containing ADC set-up
void ConfigureAdc(void)
{

    ADC10CTL1 = INCH_3 + ADC10DIV_3 ;         // Channel 3, ADC10CLK/3
    ADC10CTL0 = SREF_0 + ADC10SHT_3 + ADC10ON + ADC10IE;  // Vcc & Vss as reference, Sample and hold for 64 Clock cycles, ADC on, ADC interrupt enable
    ADC10AE0 |= BIT3;                         // ADC input enable P1.3
}
